Tekla.Structures.Drawing.DrawingObjectEnumerator
The DrawingObjectEnumerator class provides the means to iterate through drawing object instances. Drawing object enumerators
are generated by the container view and they contain drawing objects that are children of the container view instance.
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
DrawingHandler DrawingHandler = new DrawingHandler();
Drawing CurrentDrawing = DrawingHandler.GetActiveDrawing();
// Loop through all objects in the drawing and delete all existing line objects.
DrawingObjectEnumerator AllObjects = CurrentDrawing.GetSheet().GetAllObjects();
while(AllObjects.MoveNext())
{
if(AllObjects.Current is Line)
{
AllObjects.Current.Delete();
}
}
}
}

Tekla.Structures.Drawing.DrawingObjectEnumerator.Current
Gets the current drawing object.

Tekla.Structures.Drawing.DrawingObjectEnumerator.GetCurrent
Returns the current item as an object. Needed to make IEnumerator.Current work correctly.
Returns: The current item as an object.